yamaxgucci/esp32-os/sdkconfig.defaults.esp32
# ArgonOS - original ESP32 (Xtensa LX6), the hardware-only target.
#
# The primary platform is the S3; this target exists because the first real
# board in the project's hands is an ESP32-2432S028R ("cheap yellow display"):
# WROOM-32, 4 MB flash, NO PSRAM, ILI9341 240x320 on SPI, XPT2046 touch, SD on
# SPI, speaker on the built-in DAC.  Everything QEMU cannot answer - the level
# on a pin, a real bus transaction, a real cycle count - is answered here.
#
# What this target cannot do, and that is not a defect of the config: no PSRAM
# means no spike S-1 (execution from PSRAM), no megabyte .bss, and profile
# `lite` rather than `full`.  See docs/09-esp32-cyd.md.

CONFIG_IDF_TARGET="esp32"

# WROOM-32: 4 MB, DIO.  The 8 MB table does not fit - appfs would start past
# the end of the chip - so this target brings its own.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_4mb.csv"

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# The code arena is instruction RAM, and on this chip that is SRAM0: 128 KB in
# total, shared with every IRAM-resident routine ESP-IDF puts there.  192 KB
# (the S3 figure) does not exist here at all.  The kernel links at ~68 KB of
# IRAM without the arena, so ~56 KB is the ceiling and 48 leaves a margin.
#
# 40 rather than 32 for one reason: CKTBENCH is 36 KB of code, and the whole
# point of running it here is to time the circuit solver against a real cycle
# counter.  Below 36 KB it relocates into appfs and executes XIP through the
# flash cache instead, which is a different measurement - a fair one to make
# deliberately, not one to make by accident.
#
# It was 48 until the radio arrived and asked for the last 2 KB of IRAM.  That
# is what this number is: whatever is left of 128 KB after the kernel, the
# radio, and the parts of both that have to execute from RAM.
CONFIG_ARGON_APP_ARENA_KB=40

# The network, over the radio rather than over the OpenCores Ethernet MAC that
# only QEMU has.  Everything above the port is unchanged; what changes is that
# this build has no network in the emulator and a real one on the board.
#
# Wi-Fi and Bluetooth cannot both be here - see sdkconfig.esp32.ble, which is
# the other half of that sentence and the other build of this board.
CONFIG_ARGON_ENABLE_NET=y
CONFIG_ARGON_NET_WIFI=y
CONFIG_ETH_USE_OPENETH=n

# The radio's buffers, sized for a chip whose whole internal memory is 320 KB.
# The defaults assume a part with PSRAM: static rx 10 and dynamic rx 32 alone
# are more than twenty kilobytes.  These are enough for a console, a file
# transfer and a PCM stream, and are the first thing to raise if throughput
# matters more than free memory.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n

# The radio's hot paths stay in flash rather than being copied into IRAM.
#
# Not a preference: with them in IRAM the image does not link at all, because
# IRAM on this chip is 128 KB, the kernel and the code arena already hold most
# of it, and these two options ask for about 28 KB more.  They buy throughput
# by keeping the receive path out of the flash cache; what they cost here is
# the ability to build.  If the arena is ever cut back, this is the first place
# to spend the room.
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n

# The host helper on UART1 does not exist on a board and never will; leaving
# HostFS in would spend 80 KB of DRAM on its buffers and 100 ms of every boot
# on a PING nobody answers.
CONFIG_ARGON_ENABLE_HOSTFS=n

# Analogue input, off everywhere else because linking esp_adc stops the boot
# under QEMU (trap 26).  This target is not verified under QEMU - it is the one
# place the ADC can finally be tried, and the board has a light sensor wired to
# GPIO34 to try it on.
CONFIG_ARGON_ENABLE_ADC=y

CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Forty columns, because the screen soldered to this board is 320 pixels wide
# and the system draws 8-pixel cells: forty by thirty is what fits, and the
# console has to be what fits or half of every line is off the glass.  The
# serial console shows the same grid - it is one screen, rendered twice.
CONFIG_ARGON_CONSOLE_COLS=40
CONFIG_ARGON_CONSOLE_ROWS=25
